IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCAN0_CFG_MCAN0_CFG.xml
	<register id="MCAN0_CFG_RES10" acronym="MCAN0_CFG_RES10" offset="0x274" width="32" description="">
		
	</register>
	<register id="MCAN0_CFG_RES11" acronym="MCAN0_CFG_RES11" offset="0x278" width="32" description="">
		
	</register>
	<register id="MCAN0_CFG_RES12" acronym="MCAN0_CFG_RES12" offset="0x27C" width="32" description="">
		
	</register>
	<register id="MCAN0_CFG_GFC" acronym="MCAN0_CFG_GFC" offset="0x280" width="32" description="">
		<bitfield id="ANFS" width="2" begin="5" end="4" resetval="0x0" description="Accept Non-matching Frames Standard" range="5 - 4" rwaccess="RW"/> 
		<bitfield id="ANFE" width="2" begin="3" end="2" resetval="0x0" description="Accept Non-matching Frames Extended" range="3 - 2" rwaccess="RW"/> 
		<bitfield id="RRFS" width="1" begin="1" end="1" resetval="0x0" description="reject Remote Frames Standard" range="1" rwaccess="RW"/> 
		<bitfield id="RRFE" width="1" begin="0" end="0" resetval="0x0" description="reject Remote Frames Extended" range="0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_CFG_SIDFC" acronym="MCAN0_CFG_SIDFC" offset="0x284" width="32" description="">
		<bitfield id="LSS_S" width="8" begin="23" end="16" resetval="0x0" description="List Size Standard" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="FLSSA_S" width="14" begin="15" end="2" resetval="0x0" description="Filter List Standard Start Address" range="15 - 2" rwaccess="RW"/>
	</register>
	<register id="MCAN0_CFG_XIDFC" acronym="MCAN0_CFG_XIDFC" offset="0x288" width="32" description="">
		<bitfield id="LSS_X" width="8" begin="23" end="16" resetval="0x0" description="List Size Standard" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="FLSSA_X" width="14" begin="15" end="2" resetval="0x0" description="Filter List Standard Start Address" range="15 - 2" rwaccess="RW"/>
	</register>
	<register id="MCAN0_CFG_RES13" acronym="MCAN0_CFG_RES13" offset="0x28C" width="32" description="">
		
	</register>
	<register id="MCAN0_CFG_XIDAM" acronym="MCAN0_CFG_XIDAM" offset="0x290" width="32" description="">
		<bitfield id="EIDM" width="29" begin="28" end="0" resetval="0x536870911" description="Extended ID Mask" range="28 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_CFG_HPMS" acronym="MCAN0_CFG_HPMS" offset="0x294" width="32" description="">
		<bitfield id="FLST" width="1" begin="15" end="15" resetval="0x0" description="Filter List" range="15" rwaccess="RO"/> 
		<bitfield id="FIDX" width="7" begin="14" end="8" resetval="0x0" description="Filter Index" range="14 - 8" rwaccess="RO"/> 
		<bitfield id="MSI" width="2" begin="7" end="6" resetval="0x0" description="Message Storeage Indicator" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="BIDX" width="6" begin="5" end="0" resetval="0x0" description="Buffer Index" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN0_CFG_NDAT1" acronym="MCAN0_CFG_NDAT1" offset="0x298" width="32" description="">
		<bitfield id="ND0_31" width="32" begin="31" end="0" resetval="0x0" description="New Data 0-31" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_CFG_NDAT2" acronym="MCAN0_CFG_NDAT2" offset="0x29C" width="32" description="">
		<bitfield id="ND32_63" width="32" begin="31" end="0" resetval="0x0" description="New Data 32-63" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_CFG_RXF0C" acronym="MCAN0_CFG_RXF0C" offset="0x2A0" width="32" description="">
		<bitfield id="F0OM" width="1" begin="31" end="31" resetval="0x0" description="Rx FIFO 0 Operation Mode" range="31" rwaccess="RW"/> 
		<bitfield id="F0WM" width="7" begin="30" end="24" resetval="0x0" description="Rx FIFO 0 Watermark" range="30 - 24" rwaccess="RW"/> 
		<bitfield id="F0S" width="7" begin="22" end="16" resetval="0x0" description="Rx FIFO 0 Size" range="22 - 16" rwaccess="RW"/> 
		<bitfield id="F0SA" width="13" begin="14" end="2" resetval="0x0" description="Rx FIFO 0 Start Address" range="14 - 2" rwaccess="RW"/>
	</register>
	<register id="MCAN0_CFG_RXF0S" acronym="MCAN0_CFG_RXF0S" offset="0x2A4" width="32" description="">
		<bitfield id="RF0L" width="1" begin="25" end="25" resetval="0x0" description="Rx FIFO 0 Message Lost" range="25" rwaccess="RO"/> 
		<bitfield id="F0F" width="1" begin="24" end="24" resetval="0x0" description="Rx FIFO 0 Full" range="24" rwaccess="RO"/> 
		<bitfield id="F0PI" width="6" begin="21" end="16" resetval="0x0" description="Rx FIFO 0 Put Index" range="21 - 16" rwaccess="RO"/> 
		<bitfield id="F0GI" width="6" begin="13" end="8" resetval="0x0" description="Rx FIFO 0 Get Index" range="13 - 8" rwaccess="RO"/> 
		<bitfield id="F0FL" width="7" begin="6" end="0" resetval="0x0" description="Rx FIFO 0 Fill Level" range="6 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN0_CFG_RXF0A" acronym="MCAN0_CFG_RXF0A" offset="0x2A8" width="32" description="">
		<bitfield id="F0AI" width="6" begin="5" end="0" resetval="0x0" description="Rx FIFO 0 Acknowledge Index" range="5 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_CFG_RXBC" acronym="MCAN0_CFG_RXBC" offset="0x2AC" width="32" description="">
		<bitfield id="RBSA" width="14" begin="15" end="2" resetval="0x0" description="Rx Buffer Start Address" range="15 - 2" rwaccess="RW"/>
	</register>
	<register id="MCAN0_CFG_RXF1C" acronym="MCAN0_CFG_RXF1C" offset="0x2B0" width="32" description="">
		<bitfield id="F1OM" width="1" begin="31" end="31" resetval="0x0" description="Rx FIFO 0 Operation Mode" range="31" rwaccess="RW"/> 
		<bitfield id="F1WM" width="7" begin="30" end="24" resetval="0x0" description="Rx FIFO 0 Watermark" range="30 - 24" rwaccess="RW"/> 
		<bitfield id="F1S" width="7" begin="22" end="16" resetval="0x0" description="Rx FIFO 0 Size" range="22 - 16" rwaccess="RW"/> 
		<bitfield id="F1SA" width="13" begin="14" end="2" resetval="0x0" description="Rx FIFO 0 Start Address" range="14 - 2" rwaccess="RW"/>
	</register>
	<register id="MCAN0_CFG_RXF1S" acronym="MCAN0_CFG_RXF1S" offset="0x2B4" width="32" description="">
		<bitfield id="RF1L" width="1" begin="25" end="25" resetval="0x0" description="Rx FIFO 0 Message Lost" range="25" rwaccess="RO"/> 
		<bitfield id="F1F" width="1" begin="24" end="24" resetval="0x0" description="Rx FIFO 0 Full" range="24" rwaccess="RO"/> 
		<bitfield id="F1PI" width="6" begin="21" end="16" resetval="0x0" description="Rx FIFO 0 Put Index" range="21 - 16" rwaccess="RO"/> 
		<bitfield id="F1GI" width="6" begin="13" end="8" resetval="0x0" description="Rx FIFO 0 Get Index" range="13 - 8" rwaccess="RO"/> 
		<bitfield id="F1FL" width="7" begin="6" end="0" resetval="0x0" description="Rx FIFO 0 Fill Level" range="6 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN0_CFG_RXF1A" acronym="MCAN0_CFG_RXF1A" offset="0x2B8" width="32" description="">
		<bitfield id="F1AI" width="6" begin="5" end="0" resetval="0x0" description="Rx FIFO 0 Acknowledge Index" range="5 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_CFG_RXESC" acronym="MCAN0_CFG_RXESC" offset="0x2BC" width="32" description="">
		<bitfield id="RBDS" width="3" begin="10" end="8" resetval="0x0" description="Rx Buffer data Field Size" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="F1DS" width="3" begin="6" end="4" resetval="0x0" description="Rx FIFO 1 Data Field Size" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="F0DS" width="3" begin="2" end="0" resetval="0x0" description="Rx FIFO 0 Data Field Size" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_CFG_TXBC" acronym="MCAN0_CFG_TXBC" offset="0x2C0" width="32" description="">
		<bitfield id="TFQM" width="1" begin="30" end="30" resetval="0x0" description="Tx FIFO/Queue Mode" range="30" rwaccess="RO"/> 
		<bitfield id="TFQS" width="6" begin="29" end="24" resetval="0x0" description="Transmit FIFO/Queue Size" range="29 - 24" rwaccess="RO"/> 
		<bitfield id="NDTB" width="6" begin="21" end="16" resetval="0x0" description="Number of Dedicated Transmit Buffers" range="21 - 16" rwaccess="RO"/> 
		<bitfield id="TBSA" width="14" begin="15" end="2" resetval="0x0" description="Tx Buffers Start Address" range="15 - 2" rwaccess="RO"/>
	</register>
	<register id="MCAN0_CFG_TXFQS" acronym="MCAN0_CFG_TXFQS" offset="0x2C4" width="32" description="">
		<bitfield id="TFQF" width="1" begin="21" end="21" resetval="0x0" description="Tx FIFO/Queue Full" range="21" rwaccess="RO"/> 
		<bitfield id="TFQPI" width="5" begin="20" end="16" resetval="0x0" description="Tx FIFO/Queue Put Index" range="20 - 16" rwaccess="RO"/> 
		<bitfield id="TFGI" width="5" begin="12" end="8" resetval="0x0" description="Tx Queue Get Index" range="12 - 8" rwaccess="RO"/> 
		<bitfield id="TFFL" width="6" begin="5" end="0" resetval="0x0" description="Tx FIFO Free Level" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="MCAN0_CFG_TXESC" acronym="MCAN0_CFG_TXESC" offset="0x2C8" width="32" description="">
		<bitfield id="TBDS" width="3" begin="2" end="0" resetval="0x0" description="Tx Buffer Data Field Size" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MCAN0_CFG_TXBRP" acronym="MCAN0_CFG_TXBRP" offset="0x2CC" width="32" description="">
		<bitfield id="TRP" width="32" begin="31" end="0" resetval="0x0" description="Transmission Request Pending" range="31 - 0" rwaccess="RO"/>
	</register>
